#+title: nimtrs
#+property: header-args:nim+ :flags -d:plainStdout --cc:tcc --hints:off
#+property: header-args:nim+ :import nimtrs/doc_example

Ast pattern matching, templating and rewriting. Supports regex-like
patterns for sequences. Is not tied to particular AST - ~NimNode~ is
supported, but *not the only* type of AST.

This library is intended to be used not only as pattern matching for
nim ast but also as foundation for any sort of operations on
heterogenous AST trees. At least I hope it to be suitable for this
kind of task.

The readme might be a little too verbose (especially for the people
who are familliar with prolog/unification etc).


*** Variables & environment

Each variable represented using symbol (~VarSym~) and itself does not
have any value. Environment is a *mapping* (substitution) between
variable symbols and terms.

There are two types of variables - *scalar* and *list*.
- *Scalar variable* (denoted using ~$varName~) is identical regular
  prolog variable and quite similar to ~let~ variable in nim - once
  assigned value cannot be changed, unification of two bound variables
  succesed only if their values can be unified.
- *List variable* was introduces to allow capturing multiple values
  from term. Unification with this type of variables /always
  succedes/. List variable is always bound to list term but spliced
  into arguments on ~fromTerm~ conversion.

NOTE: ~ex~ and ~exUnif~ are simpler helper templates defined in
[[file:src/nimtrs/doc_example.nim]]
#+begin_src nim :exports both
  echo "--- Single use of scalar variable ---"
  exUnif(ex(Condition($a)), ex(Condition(%!mkLit("hello"))))

  echo "--- Scalar variable used twice ---"
  exUnif(
    ex(Condition($a, $a)),
    ex(Condition(%!mkLit("vareee"), %!mkLit("vareee")))
  )

  echo "--- Scalar variable used twice, different arguments ---"
  exUnif(
    ex(Condition($a, $a)),
    ex(Condition(
      %!mkLit("vareee"), # different values for constants. Variable will
      # be unified with first one `"vareee"`, but fails on second one.
      %!mkLit("((((()))))")
    ))
  )


  echo "--- List variable ---"
  exUnif(
    ex(Condition(@a, @a)), # List variable captures all terms
    ex(Condition(%!mkLit("vareee"), %!mkLit("((((()))))")))
  )
#+end_src

#+RESULTS:
: --- Single use of scalar variable ---
: {($a -> 'hello')}
: --- Scalar variable used twice ---
: {($a -> 'vareee')}
: --- Scalar variable used twice, different arguments ---
: Unification failed
: --- List variable ---
: {(@a -> ['vareee', '((((()))))'])}

# right now support for ~var -> var~ unification is supported /in
# theory/ but not really tested. I used ~env[]~ for getting values
# from environment quite extensively and ~dereference~ only in couple
# of places.

List variables are always spliced. In most cases notion of 'list' is
not present in AST - things like ~StmtList~ is just another functor
(with many arguments, yes, but functor still). This is not supported
right now, but using something like ~A([@listVariable])~ to *really*
generate list will be added.

** Regex-like pattern matching (~TermPattern~)

#+begin_src nim :exports both
  import nimtrs/[trscore, trspprint, trsdsl, nimast_trs]
  import options

  template matchPatternNim(term: NodeTerm, patt: untyped): untyped =
    matchPattern(term, nimAstImpl, patt)

  macro ifTest(body: untyped): untyped =
    for stmt in body:
      let term = stmt.toTerm(nimAstImpl)
      #                      ^^^^^^^^^^
      #                      'Implementation' - used for converting
      #                       value of type `V` to term.
      if term.matchPatternNim(
      # Match head of the `term`
      # |      Match pattern one or more times
      # |      |Match `nnkElifBrach` - `nnk` prefix might be omiited
      # |      ||  Concatenation of two parts Optional artument in the term
      # v_____ vv_________                  v v
        IfStmt(*ElifBranch(@conds, @bodies) & ?Else($elsebody))):
        #      A           ^       ^      A         ^‾‾‾‾‾‾‾‾‾‾
        #      !           |_______|      !         Possible nullable variable,
        #      !           |              !         inserted as `Option[F]`
        #      !           |              !
        #      !           Two list variables, will be inserted as `seq[V]`
        #      !                          !
        #      [ This part will consume as]
        #      [ much functor arguments as]
        #      [ possible.                ]

        for cond in conds:
          echo cond.lispRepr()

        if elsebody.isSome():
          echo "Has `else`"

  ifTest:
    if 12 == 22:
      echo "123"
    elif false:
      echo "123"
    else:
      echo "123123"

    if 20 == 29:
      echo "123"
#+end_src

#+RESULTS:
: (Infix (Ident "==") (IntLit 12) (IntLit 22))
: (Ident "false")
: Has `else`
: (Infix (Ident "==") (IntLit 20) (IntLit 29))


** AST templating

Generate term with variables and then substitute them from
environment. Examples of use (pretty simple but should illustrate the
point).

#+begin_src nim :exports both
  import nimtrs/[trscore, trspprint, trsdsl, nimast_trs]
    # import options

  template makeNimTerm(body: untyped): untyped =
    makeTerm(nimAstImpl, body)

  macro templating(arg: untyped): untyped =
    let env = makeEnvironment(@{
      parseVarSym("$a") : arg.toTerm()
    })

    let templ = makeNimTerm:
      IfStmt(
        ElifBranch($a, %!ident("hello"))
      )

    let res = templ.substitute(env).fromTerm()
    echo res.toStrLit()

  templating(1 + 2)
#+end_src

#+RESULTS:
: if 1 + 2:
:   hello

** Error reporting in DSL

This library uses [[https://github.com/haxscramper/hmisc#hmischexceptions][hmisc/hexceptions]] for DSL error reporting.

#+begin_src nim :exports both
discard initTRS(astImpl):
  Condition($a, 0) => Condition($a, $b)
#+end_src

#+RESULTS:
#+begin_example
Undeclared variable $b

 2    discard initTRS(astImpl):
 5:36   Condition($a, 0) => Condition($a, $b)
                                          ^~
                                          |
                                          Not declared in LHS



Raised in :0


 [CodeError:ObjectType]
#+end_example

** COMMENT misc

#+begin_src nim
  dumpTree:
    `ee`(`eee`)
#+end_src

#+RESULTS:
: StmtList
:   Call
:     AccQuoted
:       Ident "ee"
:     AccQuoted
:       Ident "eee"
